app/views/users/index.html.erb

SELECT COUNT(*) FROM "events"
---
  <div class="event-total">
    <p>メンバー人数: <%= @users.count %> イベント総数: <%= Event.count %></p>