app/views/events/archived.html.erb

      <div class="attendance-info">
        <p>出席人数: <%= event.attendances.where(status: '出席').count %>｜欠席人数: <%= event.attendances.where(status: '欠席').count %></p>
---
SELECT COUNT(*) FROM "attendances" WHERE "attendances"."event_id" = ? AND "attendances"."status" = ?  [["event_id", 9], ["status", "出席"]]