app/controllers/attendances_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = ? AND "attendances"."user_id" = ? LIMIT ?  [["event_id", 1], ["user_id", 1], ["LIMIT", 1]]
UPDATE "attendances" SET "status" = ?, "updated_at" = ? WHERE "attendances"."id" = ?  [["status", "absent"], ["updated_at", "2025-03-23 08:09:25.319359"], ["id", 1]]
---
  def create
    @event = Event.find(params[:event_id])
    @attendance = @event.attendances.find_or_initialize_by(user: current_user)
    if @attendance.update(status: params[:status])