app/controllers/events_controller.rb

SELECT COUNT(*) AS "count_all", "users"."position" AS "users_position" FROM "attendances" INNER JOIN "users" ON "users"."id" = "attendances"."user_id" WHERE "attendances"."event_id" = ? GROUP BY "users"."position"  [["event_id", 1]]
---
  def show
    @attendance = @event.attendances.find_by(user: current_user)
    @positions_count = @event.attendances.joins(:user).group('users.position').count