app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE (date >= ?) ORDER BY "events"."date" ASC  [[nil, "2025-04-11 06:43:00.666905"]]
---
  def index
    @events = Event.active.order(date: :asc)

SELECT "events".* FROM "events" WHERE (date < ?) ORDER BY "events"."date" DESC  [[nil, "2025-04-11 06:46:20.760408"]]
---
  def archived
    @events = Event.archived.order(date: :desc)

SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = ? AND "attendances"."user_id" = ? LIMIT ?  [["event_id", 17], ["user_id", 1], ["LIMIT", 1]]
SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = ?  [["event_id", 6]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT COUNT(*) AS "count_all", "users"."position" AS "users_position" FROM "attendances" INNER JOIN "users" ON "users"."id" = "attendances"."user_id" WHERE "attendances"."event_id" = ? AND "attendances"."status" = ? GROUP BY "users"."position"  [["event_id", 17], ["status", "出席"]]
---
  def show
    @attendance = @event.attendances.find_by(user: current_user)
    @attendances = @event.attendances.includes(:user)
    @positions_count = @event.attendances.joins(:user).where(status: '出席').group('users.position').count

INSERT INTO "events" ("title", "date", "details", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "試合"], ["date", "2025-04-23 11:46:00"], ["details", "test"], ["created_at", "2025-04-17 11:46:55.897013"], ["updated_at", "2025-04-17 11:46:55.897013"]]
---
  def create
    @event = Event.new(event_params)
    if @event.save

UPDATE "events" SET "details" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["details", "南グラウンドにていつも通りタッチフット予定"], ["updated_at", "2025-03-25 06:15:15.775657"], ["id", 7]]
---
  def update
    if @event.update(event_params)