app/controllers/users_controller.rb

  def index
    @users = case params[:sort]
             when 'position'
               User.order_by_enum(:position, User.positions.keys)
             when 'attendance_rate'
               User.all.sort_by(&:attendance_rate).reverse
---
SELECT "users".* FROM "users"

  def admin_toggle
    @user = User.find(params[:id])
    if @user.update(is_admin: params[:user][:is_admin])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "is_admin" = ? WHERE "users"."id" = ?  [["updated_at", "2025-04-01 01:56:13.643524"], ["is_admin", 1], ["id", 2]]