app/models/user.rb

  def attendance_rate
    total_events = Event.count
---
SELECT COUNT(*) FROM "events"

  def set_admin_for_first_user
    self.is_admin = true if User.count.zero? # 最初のユーザー（IDが1になる）を管理者に設定
---
SELECT COUNT(*) FROM "users"